app/Controllers/AdminController.php

    public function users()
    {
        if (!session()->get('isLoggedIn') || !in_array(session()->get('role'), ['admin', 'superadmin'])) {
            return redirect()->to('auth/login');
        }

        $model = new LoginModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`

    public function createUser()
    {
        if (!session()->get('isLoggedIn') || !in_array(session()->get('role'), ['admin', 'superadmin'])) {
            return redirect()->to('auth/login');
        }

        $model = new LoginModel();

        $username = $this->request->getPost('username');
        $email = $this->request->getPost('email');
        $role = $this->request->getPost('role');

        $defaultPassword = 'ccis1234';
        $hashedPassword = password_hash($defaultPassword, PASSWORD_DEFAULT);

        if ($model->where('username', $username)->first()) {
            return redirect()->back()->with('error', 'Username already exists.');
        }

        if ($model->where('email', $email)->first()) {
            return redirect()->back()->with('error', 'Email already exists.');
        }

        $model->insert([
            'username' => $username,
            'email' => $email,
            'userpassword' => $hashedPassword,
            'role' => $role,
            'status' => 'inactive',
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `users` (`username`, `email`, `userpassword`, `role`, `status`, `created_at`) VALUES ('jiro9', 'gironella@gmail.com', '$2y$10$OaJZ2vhLpZf.8oHSypLEXu.dS7ej/KxBdl3NS1DlKHB7CLej9bXUC', 'student', 'inactive', '2025-07-03 03:12:13')

    public function index()
    {
        if (!session()->get('isLoggedIn') || !in_array(session()->get('role'), ['admin', 'superadmin'])) {
            return redirect()->to('auth/login');
        }

        $schoolYearModel = new SchoolYearModel();
        $semesterModel = new SemesterModel();
        $courseModel = new CourseModel();
        $classModel = new ClassModel();
        $facultyModel = new FacultyModel();

        // Get counts
        $data = [
            'title' => 'Academics',
            'schoolYearsCount' => $schoolYearModel->countAllResults(),
            'semestersCount' => $semesterModel->countAllResults(),
            'coursesCount' => $courseModel->countAllResults(),
            'classesCount' => $classModel->countAllResults(),
            'facultyCount' => $facultyModel->countAllResults(),
            // Get 5 most recent courses
            'recentCourses' => $courseModel->orderBy('course_id', 'DESC')->findAll(5),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `class`
SELECT COUNT(*) AS `numrows`
FROM `faculty`
SELECT *
FROM `course`
ORDER BY `course_id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `schoolyears`
SELECT COUNT(*) AS `numrows`
FROM `semesters`
SELECT COUNT(*) AS `numrows`
FROM `course`

    public function view_courses()
    {
        $courseModel = new CourseModel();
        $data['courses'] = $courseModel->findAll();
---
SELECT *
FROM `course`

    public function updateCourse($id)
    {
        $courseModel = new CourseModel();
        $courseModel->update($id, [
            'course_code' => $this->request->getPost('course_code'),
            'course_description' => $this->request->getPost('course_description'),
            'lec_units' => $this->request->getPost('lec_units'),
            'lab_units' => $this->request->getPost('lab_units'),
        ]);

        return redirect()->to('admin/academics/courses')->with('success', 'Course updated successfully.');
---
SELECT *
FROM `course`

   public function view_classes()
    {
        $classModel = new ClassModel();
        $facultyModel = new FacultyModel();
        $userModel = new LoginModel();
        $courseModel = new CourseModel();
    $semesterModel = new SemesterModel();

        // ✅ Get all classes with JOINs on courses, semesters, schoolyears, faculty, and users
        $classes = $classModel
        ->select('class.*,
                  course.course_code, course.course_description,
                  semesters.semester, schoolyears.schoolyear,
                  faculty.faculty_id, users.fname, users.lname')
            ->join('course', 'course.course_id = class.course_id', 'left')
            ->join('semesters', 'semesters.semester_id = class.semester_id', 'left')
        ->join('schoolyears', 'schoolyears.schoolyear_id = semesters.schoolyear_id', 'left') // ✅ Add this join
        ->join('faculty', 'faculty.faculty_id = class.faculty_id', 'left')
            ->join('users', 'users.user_id = faculty.user_id', 'left')
            ->findAll();

        // ✅ Prepare instructors list
        $faculty = $facultyModel->findAll();
        $instructors = [];
        foreach ($faculty as $f) {
            $user = $userModel->find($f['user_id']);
---
SELECT `class`.*, `course`.`course_code`, `course`.`course_description`, `semesters`.`semester`, `schoolyears`.`schoolyear`, `faculty`.`faculty_id`, `users`.`fname`, `users`.`lname`
FROM `class`
LEFT JOIN `course` ON `course`.`course_id` = `class`.`course_id`
LEFT JOIN `semesters` ON `semesters`.`semester_id` = `class`.`semester_id`
LEFT JOIN `schoolyears` ON `schoolyears`.`schoolyear_id` = `semesters`.`schoolyear_id`
LEFT JOIN `faculty` ON `faculty`.`faculty_id` = `class`.`faculty_id`
LEFT JOIN `users` ON `users`.`user_id` = `faculty`.`user_id`
SELECT `semesters`.`semester_id`, `semesters`.`semester`, `schoolyears`.`schoolyear`
FROM `semesters`
LEFT JOIN `schoolyears` ON `schoolyears`.`schoolyear_id` = `semesters`.`schoolyear_id`
SELECT *
FROM `course`
SELECT *
FROM `faculty`
SELECT *
FROM `users`
WHERE `users`.`user_id` = '6'

            }
        }

        $courses = $courseModel->findAll();
    $semesters = $semesterModel->findAll();
---
SELECT *
FROM `course`
SELECT *
FROM `semesters`