app/Controllers/FacultyController.php

    public function classes()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'faculty') {
            return redirect()->to('auth/login');
        }

        $facultyId = session()->get('username');

        $classModel = new ClassModel();
        $semesterModel = new SemesterModel();

        $activeSemester = $semesterModel->where('is_active', 1)->first();

        $classes = $classModel
            ->where('faculty_id', $facultyId)
            ->where('semester_id', $activeSemester['semester_id'])
            ->findAll();
---
SELECT *
FROM `semesters`
WHERE `is_active` = 1
 LIMIT 1
SELECT *
FROM `class`
WHERE `faculty_id` = '6'
AND `semester_id` = '33'