app/Models/AnnouncementModel.php

    public function getAllWithUsernames()
    {
        return $this->db->table('announcements')
            ->select('announcements.*, users.username')
            ->join('users', 'users.user_id = announcements.created_by', 'left')
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `announcements`.*, `users`.`username`
FROM `announcements`
LEFT JOIN `users` ON `users`.`user_id` = `announcements`.`created_by`
ORDER BY `created_at` DESC