app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'ccisportal2025@gmail.com'
 LIMIT 1
---
    public function getByEmail($email)
    {
        return $this->where('email', $email)->first();

UPDATE `users` SET `otp_code` = 554834, `otp_expiry` = '2025-07-02 00:49:17'
WHERE `email` = 'ccisportal2025@gmail.com'
---
    public function storeOTP($email, $otp, $expiry)
    {
        $user = $this->getByEmail($email);

        if ($user) {
            // Just update OTP fields
            return $this->where('email', $email)
                        ->set(['otp_code' => $otp, 'otp_expiry' => $expiry])
                        ->update();

UPDATE `users` SET `is_verified` = 1
WHERE `email` = 'ccisportal2025@gmail.com'
---
    public function markVerified($email)
    {
        return $this->where('email', $email)->set('is_verified', 1)->update();

UPDATE `users` SET `userpassword` = '$2y$10$4msHeNvodzmCiYS/zilXB.jxBzlubIOfP0HPfrcx2r0QGBIbC9PYu'
WHERE `email` = 'ccisportal2025@gmail.com'
---
    public function updatePassword($email, $hashedPassword)
    {
        return $this->where('email', $email)->set('userpassword', $hashedPassword)->update();